org/_writing/article_dual_quaternions_applications.org
#+TITLE: Article - Dual Quaternions Applications
#+AUTHOR: João Gutemberg Farias
#+EMAIL: joao.gutemberg.farias@gmail.com
#+CREATED: [2021-07-08 Thu 16:07]
#+LAST_MODIFIED: [2022-01-10 Mon 16:48]
#+ROAM_TAGS: 

Esboço do artigo de revisão que estou fazendo sobre [[file:../dual_quaternions_applications.org][Dual Quaternions Applications]].

* Introdução [0/1]

** TODO cite:figueredo_robust_2013

A introdução desse trabalho é muito boa

* Medical Applications [0/2]
Acho que não vou usar

** TODO cite:birlescu2020

Muito grande. Não li. Só sei que usa os [[file:../study_parameters.org][parâmetros de Study]] e aplica num [[file:../parallel_mechanisms.org][robô médico paralelo]]

** TODO cite:husty2019

The authors proposes a new method to parametrize parallel mechanisms using Study parameters, applying it in a mechanism to help in the lower limb rehabilitation process of post-stroke patients.

* Vantagens [1/2]

** DONE Comparação com HTM [3/3]

*** DONE cite:pham2018

The proposed controller is tested using DQ and HTM. The result is that the DQ controller is almost twice as fast to compute.

*** DONE cite:yacob2020

The common way to compensate variation is using HTM. Using DQ the modeling of the problem became easier as some steps became unnecessary obtaining the same result. Also, DQ allowed to analize other types of form error which the classical model can not analize.

*** DONE cite:mirandadefarias2019

The performance of the algorithm using DQ is compared to using HTM, and the result is favorable to DQ, maybe like 33% less cost in terms of number of operations.

** TODO Técnica usando DQ melhor do que as mais comuns [0/3]

*** TODO cite:wang2018

Method for frame calibration:
The result was much favorable to the dual quaternion method when compared to a quaternion method and a Procrustes Analysis. The authors credits the higher precision of dual quaternions due to the fact that it computes rotation and translation coupled, so there is no error propagation when computing one and using the result to compute the other.

*** TODO cite:fu2020

The article concludes that the DQ methodology offers higher calibration accurary when compared to existing methods.

*** TODO cite:schwung2021

It applies two different neural networks, a DQ Recurrent NN (DQRNN) and a DQ Long Short Term Memory NN (DQLSTM). DQLSTM obtained a higher accuracy than DQRNN and when we compare it with a normal LSTM the DQLSTM got half the [[file:../root_mean_square_error.org][root mean square error (RMSE)]]. So it performed really well.


* Hyper-Dual Numbers [1/1]

** DONE cite:cohen2020

The authors applies for the first time Hyper-Dual Quaternions. Finding a compact representation of pose and its derivative in a single element. Being able to compute kinematics and differential kinematics in only one pass.

* Origami [3/3]

** DONE cite:cai2016

The authors develop a method to check for the rigid foldability of multi-vertex cylindrical origami using dual quaternions. It's a multi step method, one of the steps uses quaternions and the other uses dual quaternions.

** DONE cite:jianguo2017

The paper studies the rigid foldability of a cylindrical origami with Kresling patterns concluding that it is not rigidly foldable. DQs are used in the method that analyses the ridid foldability.

** DONE cite:wu2010

The work uses the correspondence between single-vertex rigid origami and spherical linkage to model it as quaternions and the correspondence of multi-vertex rigid origami and spatial linkage to model it as dual quaternions.


* DQ Neural Networks [2/2]

** DONE cite:schilling2019

The author uses Mean of Multiple Computations (MMC) as a hierarchical recurrent neural network to model a redundant robot. The technique generates a lot of simple equations that converge to a feasible solution where there are many ways for the same pose of the end-effector.
Using dual quaternions components in the neural network, the author can approximate transformations by interpolation, which is shown to be a great advantage of DQs.
At the end, the author shows the viability of the proposed solution applying it to a complex robot consisting of two arms each having 7 DoF. 

** DONE cite:schwung2021

The work uses [[file:../dual_quaternions_neural_networks.org][Dual-Quaternions Neural Networks]] to predict the behavior (physics) of a simulated system of masses inside a box. So the neural network predicts rigid body movement.

The authors say that using DQ in a neural network allows to incorporate physical bias into the prediction task. I.e., just by using the DQ we are already favoring the task of rigid body movement prediction, due to how DQ relates to this task.

It applies two different neural networks, a DQ Recurrent NN (DQRNN) and a DQ Long Short Term Memory NN (DQLSTM). DQLSTM obtained a higher accuracy than DQRNN and when we compare it with a normal LSTM the DQLSTM got half the [[file:../root_mean_square_error.org][root mean square error (RMSE)]]. So it performed really well.

* Machining  [2/2]

