content/posts/article_dual_quaternions_applications.md
+++
title = "Article - Dual Quaternions Applications"
author = ["João Gutemberg Farias"]
draft = false
+++

Esboço do artigo de revisão que estou fazendo sobre [Dual Quaternions Applications]({{< relref "dual_quaternions_applications" >}}).


## Introdução <code>[0/1]</code> {#introdução}


### <span class="org-todo todo TODO">TODO</span> <sup id="a666c7a16141742141ff61342199d764"><a href="#figueredo_robust_2013" title="Figueredo, Adorno, Ishihara \&amp; Borges, Robust Kinematic Control of Manipulator Robots Using Dual Quaternion Representation, 1949--1955, in in: {Robotics and {{Automation}} ({{ICRA}}), 2013 {{IEEE International Conference}} On}, edited by {IEEE} (2013)">figueredo_robust_2013</a></sup> {#943110}

A introdução desse trabalho é muito boa


## Medical Applications <code>[0/2]</code> {#medical-applications}

Acho que não vou usar


### <span class="org-todo todo TODO">TODO</span> <sup id="643835c6bb62493a58aba8836a303f78"><a href="#birlescu2020" title="Birlescu, Husty, Vaida, Gherman, Tucan \&amp; Pisla, Joint-{{Space Characterization}} of a {{Medical Parallel Robot Based}} on a {{Dual Quaternion Representation}} of {{SE}}(3), {Mathematics}, v(7), 1086 (2020).">birlescu2020</a></sup> {#38f649}

Muito grande. Não li. Só sei que usa os [parâmetros de Study]({{< relref "study_parameters" >}}) e aplica num [robô médico paralelo]({{< relref "parallel_mechanisms" >}})


### <span class="org-todo todo TODO">TODO</span> <sup id="4a1c9c09af4e1abc9e96d6a4d4dacfd4"><a href="#husty2019" title="Husty, Birlescu, Tucan, Vaida \&amp; Pisla, An Algebraic Parameterization Approach for Parallel Robots Analysis, {Mechanism and Machine Theory}, v(), 245--257 (2019).">husty2019</a></sup> {#648390}

The authors proposes a new method to parametrize parallel mechanisms using Study parameters, applying it in a mechanism to help in the lower limb rehabilitation process of post-stroke patients.


## Vantagens <code>[1/2]</code> {#vantagens}


### <span class="org-todo done DONE">DONE</span> Comparação com HTM <code>[3/3]</code> {#comparação-com-htm}


#### <span class="org-todo done DONE">DONE</span> <sup id="5ede57612c8e5d5c19c55dbc76a8853a"><a href="#pham2018" title="Pham, Adorno, Perdereau \&amp; Fraisse, Set-Point Control of Robot End-Effector Pose Using Dual Quaternion Feedback, {Robotics and Computer-Integrated Manufacturing}, v(), 100--110 (2018).">pham2018</a></sup> {#d608e6}

The proposed controller is tested using DQ and HTM. The result is that the DQ controller is almost twice as fast to compute.


#### <span class="org-todo done DONE">DONE</span> <sup id="b52bc18b61897fe939bc7b74acf0aa7c"><a href="#yacob2020" title="Yacob \&amp; Semere, Variation Compensation in Machining Processes Using Dual Quaternions, {Procedia CIRP}, v(), 879--884 (2020).">yacob2020</a></sup> {#640716}

The common way to compensate variation is using HTM. Using DQ the modeling of the problem became easier as some steps became unnecessary obtaining the same result. Also, DQ allowed to analize other types of form error which the classical model can not analize.


#### <span class="org-todo done DONE">DONE</span> <sup id="a88a6598a0751d7ebb8eff58fcc3bf61"><a href="#mirandadefarias2019" title="Miranda de Farias, da Cruz Figueredo \&amp; Yoshiyuki Ishihara, Performance {{Study}} on {{dqRNEA}} \textendash{} {{A Novel Dual Quaternion Based Recursive Newton}}-{{Euler Inverse Dynamics Algorithms}}, 94--101, in in: {2019 {{Third IEEE International Conference}} on {{Robotic Computing}} ({{IRC}})}, edited by {IEEE} (2019)">mirandadefarias2019</a></sup> {#2d7915}

The performance of the algorithm using DQ is compared to using HTM, and the result is favorable to DQ, maybe like 33% less cost in terms of number of operations.


### <span class="org-todo todo TODO">TODO</span> Técnica usando DQ melhor do que as mais comuns <code>[0/3]</code> {#técnica-usando-dq-melhor-do-que-as-mais-comuns}


#### <span class="org-todo todo TODO">TODO</span> <sup id="597bcef833a6d040afcef41bc2a99cf9"><a href="#wang2018" title="Wang, Liu \&amp; Han, A {{Method}} of {{Robot Base Frame Calibration}} by {{Using Dual Quaternion Algebra}}, {IEEE Access}, v(), 74865--74873 (2018).">wang2018</a></sup> {#bcb023}

Method for frame calibration:
The result was much favorable to the dual quaternion method when compared to a quaternion method and a Procrustes Analysis. The authors credits the higher precision of dual quaternions due to the fact that it computes rotation and translation coupled, so there is no error propagation when computing one and using the result to compute the other.


#### <span class="org-todo todo TODO">TODO</span> <sup id="497f6a856013fed14901b2617bc355c8"><a href="#fu2020" title="Fu, Pan, Spyrakos-Papastavridis, Chen \&amp; Li, A {{Dual Quaternion}}-{{Based Approach}} for {{Coordinate Calibration}} of {{Dual Robots}} in {{Collaborative Motion}}, {IEEE Robot. Autom. Lett.}, v(3), 4086--4093 (2020).">fu2020</a></sup> {#aa81ae}

The article concludes that the DQ methodology offers higher calibration accurary when compared to existing methods.


#### <span class="org-todo todo TODO">TODO</span> <sup id="414c8095cc4a3998b0a6858d107d87a8"><a href="#schwung2021" title="Schwung, Poppelbaum \&amp; Nutakki, Rigid {{Body Movement Prediction Using Dual Quaternion Recurrent Neural Networks}}, 756--761, in in: {2021 22nd {{IEEE International Conference}} on {{Industrial Technology}} ({{ICIT}})}, edited by {IEEE} (2021)">schwung2021</a></sup> {#bb562d}

It applies two different neural networks, a DQ Recurrent NN (DQRNN) and a DQ Long Short Term Memory NN (DQLSTM). DQLSTM obtained a higher accuracy than DQRNN and when we compare it with a normal LSTM the DQLSTM got half the [root mean square error (RMSE)]({{< relref "root_mean_square_error" >}}). So it performed really well.


## Hyper-Dual Numbers <code>[1/1]</code> {#hyper-dual-numbers}


### <span class="org-todo done DONE">DONE</span> <sup id="534fc4e2534d5702b6afc1d74746f0b9"><a href="#cohen2020" title="Cohen \&amp; Shoham, Hyper {{Dual Quaternions}} Representation of Rigid Bodies Kinematics, {Mechanism and Machine Theory}, v(), 103861 (2020).">cohen2020</a></sup> {#4d6276}

The authors applies for the first time Hyper-Dual Quaternions. Finding a compact representation of pose and its derivative in a single element. Being able to compute kinematics and differential kinematics in only one pass.


## Origami <code>[3/3]</code> {#origami}


### <span class="org-todo done DONE">DONE</span> <sup id="89ceacc7dafe9653593b9cfd99bd2637"><a href="#cai2016" title="Cai, Zhang, Xu, Zhou \&amp; Feng, The {{Foldability}} of {{Cylindrical Foldable Structures Based}} on {{Rigid Origami}}, {Journal of Mechanical Design}, v(3), 031401 (2016).">cai2016</a></sup> {#81df0a}

The authors develop a method to check for the rigid foldability of multi-vertex cylindrical origami using dual quaternions. It's a multi step method, one of the steps uses quaternions and the other uses dual quaternions.


### <span class="org-todo done DONE">DONE</span> <sup id="74ae13da79b7fc820b521f6e8e3e4f4b"><a href="#jianguo2017" title="Jianguo, Yangqing, Ruijun, Jian \&amp; Ya, Nonrigidly {{Foldability Analysis}} of {{Kresling Cylindrical Origami}}, {Journal of Mechanisms and Robotics}, v(4), 041018 (2017).">jianguo2017</a></sup> {#3b3324}

The paper studies the rigid foldability of a cylindrical origami with Kresling patterns concluding that it is not rigidly foldable. DQs are used in the method that analyses the ridid foldability.


### <span class="org-todo done DONE">DONE</span> <sup id="2d247d8e5df74fef24286999199d25cb"><a href="#wu2010" title="Wu \&amp; You, Modelling Rigid Origami with Quaternions and Dual Quaternions, {Proc. R. Soc. A.}, v(2119), 2155--2174 (2010).">wu2010</a></sup> {#710941}

The work uses the correspondence between single-vertex rigid origami and spherical linkage to model it as quaternions and the correspondence of multi-vertex rigid origami and spatial linkage to model it as dual quaternions.


## DQ Neural Networks <code>[2/2]</code> {#dq-neural-networks}


### <span class="org-todo done DONE">DONE</span> <sup id="4249a347fccdd66742ec1aa617d662bd"><a href="#schilling2019" title="Schilling, Hierarchical {{Dual Quaternion}}-{{Based Recurrent Neural Network}} as a {{Flexible Internal Body Model}}, 1--8, in in: {2019 {{International Joint Conference}} on {{Neural Networks}} ({{IJCNN}})}, edited by {IEEE} (2019)">schilling2019</a></sup> {#123bac}

The author uses Mean of Multiple Computations (MMC) as a hierarchical recurrent neural network to model a redundant robot. The technique generates a lot of simple equations that converge to a feasible solution where there are many ways for the same pose of the end-effector.
Using dual quaternions components in the neural network, the author can approximate transformations by interpolation, which is shown to be a great advantage of DQs.
At the end, the author shows the viability of the proposed solution applying it to a complex robot consisting of two arms each having 7 DoF.


### <span class="org-todo done DONE">DONE</span> <sup id="414c8095cc4a3998b0a6858d107d87a8"><a href="#schwung2021" title="Schwung, Poppelbaum \&amp; Nutakki, Rigid {{Body Movement Prediction Using Dual Quaternion Recurrent Neural Networks}}, 756--761, in in: {2021 22nd {{IEEE International Conference}} on {{Industrial Technology}} ({{ICIT}})}, edited by {IEEE} (2021)">schwung2021</a></sup> {#bb562d}

The work uses [Dual-Quaternions Neural Networks]({{< relref "dual_quaternions_neural_networks" >}}) to predict the behavior (physics) of a simulated system of masses inside a box. So the neural network predicts rigid body movement.

The authors say that using DQ in a neural network allows to incorporate physical bias into the prediction task. I.e., just by using the DQ we are already favoring the task of rigid body movement prediction, due to how DQ relates to this task.

It applies two different neural networks, a DQ Recurrent NN (DQRNN) and a DQ Long Short Term Memory NN (DQLSTM). DQLSTM obtained a higher accuracy than DQRNN and when we compare it with a normal LSTM the DQLSTM got half the [root mean square error (RMSE)]({{< relref "root_mean_square_error" >}}). So it performed really well.
