org/_writing/article_dual_quaternions_applications.org
** DONE cite:zhao2017

The paper proposes a dual quaternion B-Spline approximation method for using in five-axis CNC machines. The advantages of the method are: reduced computation time, reduced storage consuption, reduced number of control points. Also using the dual quaternionic method can eliminate the fitting oscillatory and solve the parameter synchronization problem simultaneously (no idea what this two mean).

** DONE cite:yacob2020

The authors use DQ to compensate for variations in machining process. The variations are differences between the ideal/projected piece and the obtained through machining.
The common way to compensate variation is using HTM. Using DQ the modeling of the problem became easier as some steps became unnecessary obtaining the same result. Also, DQ allowed to analize other types of form error which the classical model can not analize.

* Motion Planning [1/1]

** DONE cite:oh_study_2017

Alternatively to motion interpolation, cite:oh_study_2017 uses differential geometry and dual curvature theory. The author claims that it makes the expressions simpler and intuitive.

* Robotics [3/4]

** DONE Dual Robots [2/2]

*** DONE cite:chandra2018

The work uses what I think can be classified as a [[file:../dual_robots.org][Dual Robot]] but they call a Dual-Arm robot. The authors use DQ to describe and control the coordinated motion of the arms of the robot. 
In order to do that, the work defines three reference frames and uses [[file:../relative_jacobian.org][Relative Jacobians]]. Also they parametrize the task to be performed by a [[file:../virtual_mechanism.org][Virtual Mechanism]] that conects both arms. It is an interesting idea, since by doing that they can impose restrictions to the robot arms movement by the layout of the virtual mechanism. So by using this, the whole modeling looks like a two [[file:../kinematic_chains.org][chains]] parallel robot.

*** DONE cite:fu2020

** DONE SLAM [2/2]

*** DONE cite:cheng2016

Parametrizes the [[file:../simultaneous_localization_and_mapping_slam.org][SLAM (Simultaneous Location and Mapping)]] problem using dual-quaternions instead of [[file:../homogeneous_transformation_matrix.org][HTM]]. The problem is solved through a [[file:../graph_theory.org][graph]] approach that in the DQ formulation can have DQs in the vertices and in the edges, because DQs can represent both the state and the restrictions. The proposed solution improves the computational performance when compared to the same approach using HTM.

*** DONE cite:bultmann2019

[[file:../simultaneous_localization_and_mapping_slam.org][SLAM]] using an DQ unscented filter and using the stero visual data.
Não tenho muito a dizer porque não li muito.

** DONE Aerial Manipulator [1/1]

*** DONE cite:abaunza2017

The work presents modeling and control of a quadcopter with an robotic arm attached, forming a aerial manipulator. Both modeling and control uses dual quaternions.
The work is very similar to cite:abaunza_quadrotor_2016 (same authors)

** TODO Set-Point Control [0/1]
*** TODO cite:pham2018

The paper implements a [[file:../set_point_controller.org][set-point controller]] for an industrial 6DOF robot using Dual Quaternions. The authors computes the [[file:../direct_kinematics.org][direct kinematics]] using DQ and [[file:../differential_kinematics.org][differential kinematics]] using DQ as vectors in R8. The error equation is manipulated in order to obtain a matrix times a variable, but the matrix represents the system dynamics. This matrix is then writen in Laplace Domain and becomes a [[file:../transference_matrix.org][Transference Matrix]], so Classic Control techniques can be used. Using this approach, two different control laws are generated using the [[file:../jacobian_matrix.org][Jacobian Matrix]] (which are compared). The authors state that the proposed controllers does not have the best performance, compared to more sophisticated controllers, but it is simple to implement and using Laplace it is possible to tune the controller using dynamic system parameteres as damping factor and natural frequency.

* Estimation [3/3]

** DONE cite:sveier2018

The author presents a [[file:../moving_horizon_estimator_mhe.org][Moving Horizon Estimator]] for [[file:../pose_estimation.org][pose estimation]] using Dual Quaternions. They were able to formulate the [[file:../cost_function.org][cost function]] in terms of the DQ product and so satisfying the unitaryness constraint. Also they discretize the DQ and used a Caley transform presented in an article of Selig.
The resulting estimator was more accurate them DQ-MEKF (DQ Multiplicative Extended Kalman Filter) and T-UKF (Twistor-bases Unscented Kalman Filter) which the author attributes to the moving horizon strategy (so not only the last result is used).

** DONE cite:dong2019

The authors develop a Dual Quaternion based 6-DOF observer and controller. The controller has a PD-like structure. The observer and controller are validated through simulation of a spacecraft in absensce of both translational and angular velocity measurements.

** DONE cite:sveier2020

The authors develop a Dual Quaternion [[file:../particle_filter.org][Particle Filter]] and test it in the [[file:../pose_estimation.org][pose estimation]] of a hanging payload using point clouds data from a Kinect. The pose estimation is then validated showing accurate results.

* Calibration [2/2]

