content/posts/article_dual_quaternions_applications.md


## Machining  <code>[2/2]</code> {#machining}


### <span class="org-todo done DONE">DONE</span> <sup id="843b40f21c59e2f067805967760a54ca"><a href="#zhao2017" title="Zhao, Zhao, Li \&amp; Ding, Path Smoothing for Five-Axis Machine Tools Using Dual Quaternion Approximation with Dominant Points, {Int. J. Precis. Eng. Manuf.}, v(5), 711--720 (2017).">zhao2017</a></sup> {#3a3359}

The paper proposes a dual quaternion B-Spline approximation method for using in five-axis CNC machines. The advantages of the method are: reduced computation time, reduced storage consuption, reduced number of control points. Also using the dual quaternionic method can eliminate the fitting oscillatory and solve the parameter synchronization problem simultaneously (no idea what this two mean).


### <span class="org-todo done DONE">DONE</span> <sup id="b52bc18b61897fe939bc7b74acf0aa7c"><a href="#yacob2020" title="Yacob \&amp; Semere, Variation Compensation in Machining Processes Using Dual Quaternions, {Procedia CIRP}, v(), 879--884 (2020).">yacob2020</a></sup> {#640716}

The authors use DQ to compensate for variations in machining process. The variations are differences between the ideal/projected piece and the obtained through machining.
The common way to compensate variation is using HTM. Using DQ the modeling of the problem became easier as some steps became unnecessary obtaining the same result. Also, DQ allowed to analize other types of form error which the classical model can not analize.


## Motion Planning <code>[1/1]</code> {#motion-planning}


### <span class="org-todo done DONE">DONE</span> <sup id="424b1f73619bc284e79679d73ad7f225"><a href="#oh_study_2017" title="Oh, Abhishesh \&amp; Ryuh, Study on {{Robot Trajectory Planning}} by {{Robot}} {{End}}-{{Effector Using Dual Curvature Theory}} of the {{Ruled Surface}}, {International Journal of Mechanical and Materials Engineering}, v(3), 6 (2017).">oh_study_2017</a></sup> {#cfe225}

Alternatively to motion interpolation, <sup id="424b1f73619bc284e79679d73ad7f225"><a href="#oh_study_2017" title="Oh, Abhishesh \&amp; Ryuh, Study on {{Robot Trajectory Planning}} by {{Robot}} {{End}}-{{Effector Using Dual Curvature Theory}} of the {{Ruled Surface}}, {International Journal of Mechanical and Materials Engineering}, v(3), 6 (2017).">oh_study_2017</a></sup> uses differential geometry and dual curvature theory. The author claims that it makes the expressions simpler and intuitive.


## Robotics <code>[3/4]</code> {#robotics}


### <span class="org-todo done DONE">DONE</span> Dual Robots <code>[2/2]</code> {#dual-robots}


#### <span class="org-todo done DONE">DONE</span> <sup id="a4dceea8d49ed091b58811d886fc3444"><a href="#chandra2018" title="Chandra, Mateo, Corrales-Ramon \&amp; Mezouar, Dual-{{Arm Coordination Using Dual Quaternions}} and {{Virtual Mechanisms}}, 759--765, in in: {2018 {{IEEE International Conference}} on {{Robotics}} and {{Biomimetics}} ({{ROBIO}})}, edited by {IEEE} (2018)">chandra2018</a></sup> {#454b9c}

The work uses what I think can be classified as a [Dual Robot]({{< relref "dual_robots" >}}) but they call a Dual-Arm robot. The authors use DQ to describe and control the coordinated motion of the arms of the robot.
In order to do that, the work defines three reference frames and uses [Relative Jacobians]({{< relref "relative_jacobian" >}}). Also they parametrize the task to be performed by a [Virtual Mechanism]({{< relref "virtual_mechanism" >}}) that conects both arms. It is an interesting idea, since by doing that they can impose restrictions to the robot arms movement by the layout of the virtual mechanism. So by using this, the whole modeling looks like a two [chains]({{< relref "kinematic_chains" >}}) parallel robot.


#### <span class="org-todo done DONE">DONE</span> <sup id="497f6a856013fed14901b2617bc355c8"><a href="#fu2020" title="Fu, Pan, Spyrakos-Papastavridis, Chen \&amp; Li, A {{Dual Quaternion}}-{{Based Approach}} for {{Coordinate Calibration}} of {{Dual Robots}} in {{Collaborative Motion}}, {IEEE Robot. Autom. Lett.}, v(3), 4086--4093 (2020).">fu2020</a></sup> {#aa81ae}


### <span class="org-todo done DONE">DONE</span> SLAM <code>[2/2]</code> {#slam}


#### <span class="org-todo done DONE">DONE</span> <sup id="f81900bfc159c2c268a8aa36c1082377"><a href="#cheng2016" title="Cheng, Kim, Jiang \&amp; Che, Dual Quaternion-Based Graphical {{SLAM}}, {Robotics and Autonomous Systems}, v(), 15--24 (2016).">cheng2016</a></sup> {#85d11c}

Parametrizes the [SLAM (Simultaneous Location and Mapping)]({{< relref "simultaneous_localization_and_mapping_slam" >}}) problem using dual-quaternions instead of [HTM]({{< relref "homogeneous_transformation_matrix" >}}). The problem is solved through a [graph]({{< relref "graph_theory" >}}) approach that in the DQ formulation can have DQs in the vertices and in the edges, because DQs can represent both the state and the restrictions. The proposed solution improves the computational performance when compared to the same approach using HTM.


#### <span class="org-todo done DONE">DONE</span> <sup id="f0a1695fbd59e42430ca9ed7ce39a984"><a href="#bultmann2019" title="Bultmann, Li \&amp; Hanebeck, Stereo {{Visual SLAM Based}} on {{Unscented Dual Quaternion Filtering}}, v(), 8 (2019).">bultmann2019</a></sup> {#f5446e}

[SLAM]({{< relref "simultaneous_localization_and_mapping_slam" >}}) using an DQ unscented filter and using the stero visual data.
Não tenho muito a dizer porque não li muito.


### <span class="org-todo done DONE">DONE</span> Aerial Manipulator <code>[1/1]</code> {#aerial-manipulator}


#### <span class="org-todo done DONE">DONE</span> <sup id="9b8b8f5b8e41c78bd18104de4e60cedc"><a href="#abaunza2017" title="Abaunza, Castillo, Victorino \&amp; Lozano, Dual {{Quaternion Modeling}} and {{Control}} of a {{Quad}}-Rotor {{Aerial Manipulator}}, {J Intell Robot Syst}, v(2-4), 267--283 (2017).">abaunza2017</a></sup> {#9cdc4b}

The work presents modeling and control of a quadcopter with an robotic arm attached, forming a aerial manipulator. Both modeling and control uses dual quaternions.
The work is very similar to <sup id="c5131fa61eb5d7177d4fdf0d017a8cb7"><a href="#abaunza_quadrotor_2016" title="Abaunza, Castillo, Lozano \&amp; Victorino, Quadrotor Aerial Manipulator Based on Dual Quaternions, 152--161, in in: {Unmanned {{Aircraft Systems}} ({{ICUAS}}), 2016 {{International Conference}} On}, edited by {IEEE} (2016)">abaunza_quadrotor_2016</a></sup> (same authors)


### <span class="org-todo todo TODO">TODO</span> Set-Point Control <code>[0/1]</code> {#set-point-control}


#### <span class="org-todo todo TODO">TODO</span> <sup id="5ede57612c8e5d5c19c55dbc76a8853a"><a href="#pham2018" title="Pham, Adorno, Perdereau \&amp; Fraisse, Set-Point Control of Robot End-Effector Pose Using Dual Quaternion Feedback, {Robotics and Computer-Integrated Manufacturing}, v(), 100--110 (2018).">pham2018</a></sup> {#d608e6}

The paper implements a [set-point controller]({{< relref "set_point_controller" >}}) for an industrial 6DOF robot using Dual Quaternions. The authors computes the [direct kinematics]({{< relref "direct_kinematics" >}}) using DQ and [differential kinematics]({{< relref "differential_kinematics" >}}) using DQ as vectors in R8. The error equation is manipulated in order to obtain a matrix times a variable, but the matrix represents the system dynamics. This matrix is then writen in Laplace Domain and becomes a [Transference Matrix]({{< relref "transference_matrix" >}}), so Classic Control techniques can be used. Using this approach, two different control laws are generated using the [Jacobian Matrix]({{< relref "jacobian_matrix" >}}) (which are compared). The authors state that the proposed controllers does not have the best performance, compared to more sophisticated controllers, but it is simple to implement and using Laplace it is possible to tune the controller using dynamic system parameteres as damping factor and natural frequency.


## Estimation <code>[3/3]</code> {#estimation}


### <span class="org-todo done DONE">DONE</span> <sup id="6cc334e272a3940da00d7d02b1c606ed"><a href="#sveier2018" title="Sveier \&amp; Egeland, Pose {{Estimation}} Using {{Dual Quaternions}} and {{Moving Horizon Estimation}}, {IFAC-PapersOnLine}, v(13), 186--191 (2018).">sveier2018</a></sup> {#59fdfc}

The author presents a [Moving Horizon Estimator]({{< relref "moving_horizon_estimator_mhe" >}}) for [pose estimation]({{< relref "pose_estimation" >}}) using Dual Quaternions. They were able to formulate the [cost function]({{< relref "cost_function" >}}) in terms of the DQ product and so satisfying the unitaryness constraint. Also they discretize the DQ and used a Caley transform presented in an article of Selig.
The resulting estimator was more accurate them DQ-MEKF (DQ Multiplicative Extended Kalman Filter) and T-UKF (Twistor-bases Unscented Kalman Filter) which the author attributes to the moving horizon strategy (so not only the last result is used).


### <span class="org-todo done DONE">DONE</span> <sup id="816b389312aa70e77ba23e9dcfdc36a8"><a href="#dong2019" title="Dong, Hu, Akella \&amp; Mazenc, Partial {{Lyapunov Strictification}}: {{Dual}}-{{Quaternion}}-{{Based Observer}} for 6-{{DOF Tracking Control}}, {IEEE Trans. Contr. Syst. Technol.}, v(6), 2453--2469 (2019).">dong2019</a></sup> {#3d2296}

The authors develop a Dual Quaternion based 6-DOF observer and controller. The controller has a PD-like structure. The observer and controller are validated through simulation of a spacecraft in absensce of both translational and angular velocity measurements.


### <span class="org-todo done DONE">DONE</span> <sup id="8b40081c0d2bed67397c17a806abd466"><a href="#sveier2020" title="Sveier \&amp; Egeland, Dual {{Quaternion Particle Filtering}} for {{Pose Estimation}}, {IEEE Trans. Contr. Syst. Technol.}, v(), 1--14 (2020).">sveier2020</a></sup> {#7a6200}

The authors develop a Dual Quaternion [Particle Filter]({{< relref "particle_filter" >}}) and test it in the [pose estimation]({{< relref "pose_estimation" >}}) of a hanging payload using point clouds data from a Kinect. The pose estimation is then validated showing accurate results.
