org/_writing/article_dual_quaternions_applications.org
** DONE cite:wang2018

The work proposes a method for calibrating the transformation between the [[file:../inertial_frame.org][inertial/world frame]] and the [[file:../body_frame.org][robot frame]]. It uses a sensor to measure the position of the [[file:../end_link.org][end-effector]] and calibrates the dual quaternion resposible to acheive the transformation.

The result was much favorable to the dual quaternion method when compared to a quaternion method and a Procrustes Analysis. The authors credits the higher precision of dual quaternions due to the fact that it computes rotation and translation coupled, so there is no error propagation when computing one and using the result to compute the other.

** DONE cite:fu2020

Interesting article about coordinate calibration of [[file:../dual_robots.org][dual robots]] using dual quaternions. The problem itself is very interesting, we have two robot coordinates system, one camera coordinate system and one coordinate system relative to the object being held. So in order to relate all this coordinates systems and assure that they are calibrated, the authors calibrate a hand-eye, a robot-robot and a tool-flange transformations.

* Formation Control [2/2]

** DONE cite:giribet2021

The authors present a cluster-space formation control and apply it to leader-follower configuration using dual quaternions and reducing steady-state errors when compared to previous works. Experiments are made to validade the formation control using a ground and an aerial vehicles, and using two aerial vehicles.

** DONE cite:huang2017

The work proposes a [[file:../formation_control.org][formation control]] using dual quaternions, the formation error is controlled through a [[file:../sliding_modes.org][sliding modes controller]] and one term is added for [[file:../collision_avoidance.org][collision avoidance]] using [[file:../artificial_potential_function.org][Artificial Potential Function]].

* Whole-Body [1/1]

** DONE cite:silva2018

The papers proposes a [[file:../whole_body_control.org][whole-body control]] using [[file:../feedback_linearization.org][Feedback Linearization]] in a DQ framework. Experiments are made using a nonholonomic mobile ground vehicle with 5-DOF [[file:../serial_mechanism.org][manipulator arm]].

* Aerospace [4/4]

** DONE cite:dong2018 

The work shows the control of a [[file:../rendezvous_and_docking.org][Rendezvous and Docking]] process using dual quaternions to describe the kinematics and formulate two restrictions, one for the line of sight of the chaser to the target spacecraft and other to ensure a safe approach path from the chaser to the target in order to not hit any external equipament of the target. The authors use Artificial Potential Functions to formulate the control problem and perform a [[file:../lyapunov_stability_analysis.org][Lyapunov Stability Analysis]]. 

** DONE cite:valverde2018

The work describes an framework to derive the dynamics of a satellite, but it can be used to a general serial mechanism (at least I think), the proposed framework works with revolute, prismatic, cylindrical, spherical and planar joints. The equations are computed using dual quaternions and [[file:../newton_euler_method.org][Newton-Euler formulation]].

** DONE cite:sun2020 

Uses dual quaternions to model an eletromagnetic force with applications in satellites. Also derives the dynamics equations of the satellites subject to this force.

** DONE cite:reynolds2020 

It uses dual quaternions in the [[file:../powered_descent_guidance.org][powered descent guidance]] problem. The article uses several restrictions in the control formulation, it uses a [[file:../line_of_sight_restriction.org][line-of-sight]] restriction (a new type they call slant-range-triggered line-of-sight), also a restriction as a window for the allowed values of the control effort (propulsion power). The control problem is solved through a nonconvex optimization problem.

* Control [0/0]

** Erro [1/1]

*** DONE cite:figueredo_robust_2013

Nova métrica de erro

** MPC [1/1]

*** DONE cite:lee_optimal_2015

Citar junto de cite:lee_constrained_2017.

** Kinematic Control [1/1]

*** DONE cite:ozgur2016
Tá na parte de Serial Mechanism

** Feedback Linearization [2/2]

*** DONE cite:antonello2018

The work proposes a [[file:../maneuver_regulation.org][Maneuver Regulation]] Feedback Linearization Controller using dual quaternions for a 6Dof free body. The results show better results for the Maneuver Regulation than the [[file:../trajectory_tracking.org][Trajectory Tracking]].

*** DONE cite:silva2018

** Backstepping [1/1]

*** DONE cite:stianandersen2018

The work proposes a Backstepping controller for a fully actuated rigid-body using Dual Quaternions. The controller is proved to be asymptotically stable using Lyapunov.

** Sliding Modes [2/2]

