content/posts/article_dual_quaternions_applications.md


## Calibration <code>[2/2]</code> {#calibration}


### <span class="org-todo done DONE">DONE</span> <sup id="597bcef833a6d040afcef41bc2a99cf9"><a href="#wang2018" title="Wang, Liu \&amp; Han, A {{Method}} of {{Robot Base Frame Calibration}} by {{Using Dual Quaternion Algebra}}, {IEEE Access}, v(), 74865--74873 (2018).">wang2018</a></sup> {#bcb023}

The work proposes a method for calibrating the transformation between the [inertial/world frame]({{< relref "inertial_frame" >}}) and the [robot frame]({{< relref "body_frame" >}}). It uses a sensor to measure the position of the [end-effector]({{< relref "end_link" >}}) and calibrates the dual quaternion resposible to acheive the transformation.

The result was much favorable to the dual quaternion method when compared to a quaternion method and a Procrustes Analysis. The authors credits the higher precision of dual quaternions due to the fact that it computes rotation and translation coupled, so there is no error propagation when computing one and using the result to compute the other.


### <span class="org-todo done DONE">DONE</span> <sup id="497f6a856013fed14901b2617bc355c8"><a href="#fu2020" title="Fu, Pan, Spyrakos-Papastavridis, Chen \&amp; Li, A {{Dual Quaternion}}-{{Based Approach}} for {{Coordinate Calibration}} of {{Dual Robots}} in {{Collaborative Motion}}, {IEEE Robot. Autom. Lett.}, v(3), 4086--4093 (2020).">fu2020</a></sup> {#aa81ae}

Interesting article about coordinate calibration of [dual robots]({{< relref "dual_robots" >}}) using dual quaternions. The problem itself is very interesting, we have two robot coordinates system, one camera coordinate system and one coordinate system relative to the object being held. So in order to relate all this coordinates systems and assure that they are calibrated, the authors calibrate a hand-eye, a robot-robot and a tool-flange transformations.


## Formation Control <code>[2/2]</code> {#formation-control}


### <span class="org-todo done DONE">DONE</span> <sup id="bc527fe28b161aa5db1129e3156c6a16"><a href="#giribet2021" title="Giribet, Colombo, Moreno, Mas \&amp; Dimarogonas, Dual {{Quaternion Cluster}}-{{Space Formation Control}}, {IEEE Robot. Autom. Lett.}, v(), 1--1 (2021).">giribet2021</a></sup> {#d370c3}

The authors present a cluster-space formation control and apply it to leader-follower configuration using dual quaternions and reducing steady-state errors when compared to previous works. Experiments are made to validade the formation control using a ground and an aerial vehicles, and using two aerial vehicles.


### <span class="org-todo done DONE">DONE</span> <sup id="00f39b5169f2732fdc4ff7583047a966"><a href="#huang2017" title="Huang, Yan, Zhou \&amp; Yang, Dual-Quaternion Based Distributed Coordination Control of Six-{{DOF}} Spacecraft Formation with Collision Avoidance, {Aerospace Science and Technology}, v(), 443--455 (2017).">huang2017</a></sup> {#6d3872}

The work proposes a [formation control]({{< relref "formation_control" >}}) using dual quaternions, the formation error is controlled through a [sliding modes controller]({{< relref "sliding_modes" >}}) and one term is added for [collision avoidance]({{< relref "collision_avoidance" >}}) using [Artificial Potential Function]({{< relref "artificial_potential_function" >}}).


## Whole-Body <code>[1/1]</code> {#whole-body}


### <span class="org-todo done DONE">DONE</span> <sup id="747e94e6940d1d9117cd49b9b40b1669"><a href="#silva2018" title="Silva \&amp; Adorno, Whole-Body {{Control}} of a {{Mobile Manipulator Using Feedback Linearization}} and {{Dual Quaternion Algebra}}, {J Intell Robot Syst}, v(2), 249--262 (2018).">silva2018</a></sup> {#b032a7}

The papers proposes a [whole-body control]({{< relref "whole_body_control" >}}) using [Feedback Linearization]({{< relref "feedback_linearization" >}}) in a DQ framework. Experiments are made using a nonholonomic mobile ground vehicle with 5-DOF [manipulator arm]({{< relref "serial_mechanism" >}}).


## Aerospace <code>[4/4]</code> {#aerospace}


### <span class="org-todo done DONE">DONE</span> <sup id="a7397c53ce111ae612c0c747cdd4f42e"><a href="#dong2018" title="Dong, Hu \&amp; Akella, Dual-{{Quaternion}}-{{Based Spacecraft Autonomous Rendezvous}} and {{Docking Under Six}}-{{Degree}}-of-{{Freedom Motion Constraints}}, {Journal of Guidance, Control, and Dynamics}, v(5), 1150--1162 (2018).">dong2018</a></sup> {#f8feeb}

The work shows the control of a [Rendezvous and Docking]({{< relref "rendezvous_and_docking" >}}) process using dual quaternions to describe the kinematics and formulate two restrictions, one for the line of sight of the chaser to the target spacecraft and other to ensure a safe approach path from the chaser to the target in order to not hit any external equipament of the target. The authors use Artificial Potential Functions to formulate the control problem and perform a [Lyapunov Stability Analysis]({{< relref "lyapunov_stability_analysis" >}}).


### <span class="org-todo done DONE">DONE</span> <sup id="a9415d881eb3c65938675574eded8747"><a href="#valverde2018" title="Valverde \&amp; Tsiotras, Dual {{Quaternion Framework}} for {{Modeling}} of {{Spacecraft}}-{{Mounted Multibody Robotic Systems}}, {Front. Robot. AI}, v(), 128 (2018).">valverde2018</a></sup> {#59d396}

The work describes an framework to derive the dynamics of a satellite, but it can be used to a general serial mechanism (at least I think), the proposed framework works with revolute, prismatic, cylindrical, spherical and planar joints. The equations are computed using dual quaternions and [Newton-Euler formulation]({{< relref "newton_euler_method" >}}).


### <span class="org-todo done DONE">DONE</span> <sup id="961cfc7a1f3349013177b65701226deb"><a href="#sun2020" title="Sun, Wu, Chen, Hao, Mantey \&amp; Zhao, Dual Quaternion Based Dynamics Modeling for Electromagnetic Collocated Satellites of Diffraction Imaging on Geostationary Orbit, {Acta Astronautica}, v(), 52--58 (2020).">sun2020</a></sup> {#131500}

Uses dual quaternions to model an eletromagnetic force with applications in satellites. Also derives the dynamics equations of the satellites subject to this force.


### <span class="org-todo done DONE">DONE</span> <sup id="b82e61e20b87e3bbb72a4417d1e3b640"><a href="#reynolds2020" title="Reynolds, Szmuk, Malyuta, Mesbahi, A\c c\ikme\c se \&amp; Carson, Dual {{Quaternion}}-{{Based Powered Descent Guidance}} with {{State}}-{{Triggered Constraints}}, {Journal of Guidance, Control, and Dynamics}, v(9), 1584--1599 (2020).">reynolds2020</a></sup> {#ad663c}

It uses dual quaternions in the [powered descent guidance]({{< relref "powered_descent_guidance" >}}) problem. The article uses several restrictions in the control formulation, it uses a [line-of-sight]({{< relref "line_of_sight_restriction" >}}) restriction (a new type they call slant-range-triggered line-of-sight), also a restriction as a window for the allowed values of the control effort (propulsion power). The control problem is solved through a nonconvex optimization problem.


## Control <code>[0/0]</code> {#control}


### Erro <code>[1/1]</code> {#erro}


#### <span class="org-todo done DONE">DONE</span> <sup id="a666c7a16141742141ff61342199d764"><a href="#figueredo_robust_2013" title="Figueredo, Adorno, Ishihara \&amp; Borges, Robust Kinematic Control of Manipulator Robots Using Dual Quaternion Representation, 1949--1955, in in: {Robotics and {{Automation}} ({{ICRA}}), 2013 {{IEEE International Conference}} On}, edited by {IEEE} (2013)">figueredo_robust_2013</a></sup> {#943110}

Nova métrica de erro


### MPC <code>[1/1]</code> {#mpc}


#### <span class="org-todo done DONE">DONE</span> <sup id="1698b27182529f1933204f1b88e999a1"><a href="#lee_optimal_2015" title="Lee \&amp; Mesbahi, Optimal {{Power Descent Guidance}} with 6-{{DoF Line}} of {{Sight Constraints}} via {{Unit Dual Quaternions}}, in in: {{{AIAA Guidance}}, {{Navigation}}, and {{Control Conference}}}, edited by {American Institute of Aeronautics and Astronautics} (2015)">lee_optimal_2015</a></sup> {#4905c8}

Citar junto de <sup id="e5d268641d698c2ba96ef845d1523876"><a href="#lee_constrained_2017" title="Lee \&amp; Mesbahi, Constrained {{Autonomous Precision Landing}} via {{Dual Quaternions}} and {{Model Predictive Control}}, {Journal of Guidance, Control, and Dynamics}, v(2), 292--308 (2017).">lee_constrained_2017</a></sup>.


### Kinematic Control <code>[1/1]</code> {#kinematic-control}


#### <span class="org-todo done DONE">DONE</span> <sup id="33cbc6f7bc59ab3b6dddeb95d9d74a7c"><a href="#ozgur2016" title="\Ozg\ur \&amp; Mezouar, Kinematic Modeling and Control of a Robot Arm Using Unit Dual Quaternions, {Robotics and Autonomous Systems}, v(), 66--73 (2016).">ozgur2016</a></sup> {#4501f1}

Tá na parte de Serial Mechanism


### Feedback Linearization <code>[2/2]</code> {#feedback-linearization}


#### <span class="org-todo done DONE">DONE</span> <sup id="250c67f44896242e9eb11b93a1064f7e"><a href="#antonello2018" title="Antonello, Michieletto, Antonello \&amp; Cenedese, A {{Dual Quaternion Feedback Linearized Approach}} for {{Maneuver Regulation}} of {{Rigid Bodies}}, {IEEE Control Syst. Lett.}, v(3), 327--332 (2018).">antonello2018</a></sup> {#605165}

The work proposes a [Maneuver Regulation]({{< relref "maneuver_regulation" >}}) Feedback Linearization Controller using dual quaternions for a 6Dof free body. The results show better results for the Maneuver Regulation than the [Trajectory Tracking]({{< relref "trajectory_tracking" >}}).


#### <span class="org-todo done DONE">DONE</span> <sup id="747e94e6940d1d9117cd49b9b40b1669"><a href="#silva2018" title="Silva \&amp; Adorno, Whole-Body {{Control}} of a {{Mobile Manipulator Using Feedback Linearization}} and {{Dual Quaternion Algebra}}, {J Intell Robot Syst}, v(2), 249--262 (2018).">silva2018</a></sup> {#b032a7}


### Backstepping <code>[1/1]</code> {#backstepping}


#### <span class="org-todo done DONE">DONE</span> <sup id="d65d8a99efce5572c9ab01631f1051cd"><a href="#stianandersen2018" title="Stian Andersen, Johansen \&amp; Kristiansen, Dual-Quaternion Backstepping Control for a Fully-Actuated Rigid-Body, 5653--5658, in in: {2018 {{Annual American Control Conference}} ({{ACC}})}, edited by {IEEE} (2018)">stianandersen2018</a></sup> {#ab3b05}

The work proposes a Backstepping controller for a fully actuated rigid-body using Dual Quaternions. The controller is proved to be asymptotically stable using Lyapunov.
