org/_writing/article_dual_quaternions_applications.org
*** DONE cite:dong2017

A fault-tolerant sliding modes controller using dual quaternions is proposed for a target-pursuer spacecraft tracking. The proposed controller can achieve a few desired properties as tracking error converging to zero within a choosed finite time. The faults can be partial or total actuator power loss, actuator offset and locking.
The controller is used in a simulation showing promising results.

*** DONE cite:huang2017

** $H_\infty$  [1/1]

*** DONE cite:figueredo_robust_2013

Controle robusto do tipo $H_\infty$

[[file:../_refs/figueredo_robust_2013.org][figueredo_robust_2013 | Robust kinematic control of manipulator robots using dual quaternion representation]]


** Resolved-Acceleration Control [1/1]

*** DONE cite:chandra2020

The authors propose a new controller using [[file:../resolved_acceleration_control.org][Resolved-Acceleration Control]] (looks like a [[file:../feedback_linearization.org][feedback linearization]]) for the trajectory tracking of serial robotic manipulators using dual quaternions and based on screw theory.
The controller is compared to a uncoupled controller (which separates translation and orientation) getting similar results, actually performed worse on position but better on orientation.

* Serial Mechanism [2/2]

** DONE cite:ozgur2016

Very interesting article of kinematic modeling and control of robotic arms. It uses a [[file:../screw_theory.org][Screw Theory]] approach to model the kinematics, much like [[file:../successive_screws.org][Successive Screws]], but using only one frame, doesn't need a [[file:../convenient_frame.org][convenient frame]]. Also the metodology is mind opening someway because the authors model the rotations from [[file:../end_link.org][end-effector]] to [[file:../base_link.org][base]], and not the opositte, which in my opinion is easier to understand because going from end to base the successive rotations are not carried by the previous rotations.

** DONE cite:amininan2017 

The paper solves the [[file:../inverse_kinematics.org][inverse kinematics]] of an specific [[file:../serial_mechanism.org][serial 6dof industrial arm]] using dual quaternions. The [[file:../direct_kinematics.org][direct kinematics]] equations are derived using DQ and through manipulating the equations they can solve it for the inverse kinematics problem. Nothing too fancy or new.

* Parallel Mechanism [1/1]

** DONE cite:shabani2021

The authors uses dual quaternions to formulate closure loop equations as a system of multiaffine equations, they then introduce a new branch-and-prune method tailored to this type of equations to solve the system which can reduce computing time up to 2 orders of magnitude compared to traditional approaches.

* Dynamics [2/2]

** DONE cite:valverde2018

The work describes an framework to derive the dynamics of a satellite, but it can be used to a general serial mechanism (at least I think), the proposed framework works with revolute, prismatic, cylindrical, spherical and planar joints. The equations are computed using dual quaternions and [[file:../newton_euler_method.org][Newton-Euler formulation]].

** DONE cite:mirandadefarias2019

The work do a performace study on an Recursive [[file:../newton_euler_method.org][Newton-Euler]] Inverse Dynamics Algorithm using dual quaternions. The algorithm uses Newton-Euler formulation to compute the kinematics and given the desired accelerations and external forces, computes the necessary torques of the motors to drive the system.

They use dual quaternions in the kinematics and kinetics, for the inertia they create an inertia function (so not explicitily a matrix). They use a screw theory approach for the kinematics, not using DH.

The performance of the algorithm using DQ is compared to using HTM, and the result is favorable to DQ, maybe like 33% less cost in terms of number of operations.

* Desvantagens [0/0]


* DONE Adicionar as referências lidas.

** DONE Colocar as referencias no General Overview

** DONE Colocar no resto do trabalho

* DONE Coisas a ver no trabalho

** DONE Ver se no meu trabalho eu faço o uso de q1.q2 = 0 onde q = q1 + eps q2

* TODO Fazer as correções de Edson

* TODO O que fazer sobre a parte de Geometric Modeling

- [ ] Tirar 
- [ ] Deixar junto
- [ ] Deixar separado

* TODO Após o artigo

** TODO Ler trabalhos de Featherstone citados em cite:ozgur2016

