content/posts/article_dual_quaternions_applications.md


### Sliding Modes <code>[2/2]</code> {#sliding-modes}


#### <span class="org-todo done DONE">DONE</span> <sup id="69eba384118ecb36a0350ee94a5b7f82"><a href="#dong2017" title="Dong, Hu, Friswell \&amp; Ma, Dual-{{Quaternion}}-{{Based Fault}}-{{Tolerant Control}} for {{Spacecraft Tracking With Finite}}-{{Time Convergence}}, {IEEE Trans. Contr. Syst. Technol.}, v(4), 1231--1242 (2017).">dong2017</a></sup> {#efa649}

A fault-tolerant sliding modes controller using dual quaternions is proposed for a target-pursuer spacecraft tracking. The proposed controller can achieve a few desired properties as tracking error converging to zero within a choosed finite time. The faults can be partial or total actuator power loss, actuator offset and locking.
The controller is used in a simulation showing promising results.


#### <span class="org-todo done DONE">DONE</span> <sup id="00f39b5169f2732fdc4ff7583047a966"><a href="#huang2017" title="Huang, Yan, Zhou \&amp; Yang, Dual-Quaternion Based Distributed Coordination Control of Six-{{DOF}} Spacecraft Formation with Collision Avoidance, {Aerospace Science and Technology}, v(), 443--455 (2017).">huang2017</a></sup> {#6d3872}


### \\(H\_\infty\\)  <code>[1/1]</code> {#h-infty}


#### <span class="org-todo done DONE">DONE</span> <sup id="a666c7a16141742141ff61342199d764"><a href="#figueredo_robust_2013" title="Figueredo, Adorno, Ishihara \&amp; Borges, Robust Kinematic Control of Manipulator Robots Using Dual Quaternion Representation, 1949--1955, in in: {Robotics and {{Automation}} ({{ICRA}}), 2013 {{IEEE International Conference}} On}, edited by {IEEE} (2013)">figueredo_robust_2013</a></sup> {#943110}

Controle robusto do tipo \\(H\_\infty\\)

[figueredo_robust_2013 | Robust kinematic control of manipulator robots using dual quaternion representation]({{< relref "figueredo_robust_2013" >}})


### Resolved-Acceleration Control <code>[1/1]</code> {#resolved-acceleration-control}


#### <span class="org-todo done DONE">DONE</span> <sup id="6e9325dd1e4ceb41e14995834d9a3536"><a href="#chandra2020" title="Chandra, Corrales-Ramon \&amp; Mezouar, Resolved-{{Acceleration Control}} of {{Serial Robotic Manipulators Using Unit Dual Quaternions}}, {IFAC-PapersOnLine}, v(2), 8500--8505 (2020).">chandra2020</a></sup> {#a94c6b}

The authors propose a new controller using [Resolved-Acceleration Control]({{< relref "resolved_acceleration_control" >}}) (looks like a [feedback linearization]({{< relref "feedback_linearization" >}})) for the trajectory tracking of serial robotic manipulators using dual quaternions and based on screw theory.
The controller is compared to a uncoupled controller (which separates translation and orientation) getting similar results, actually performed worse on position but better on orientation.


## Serial Mechanism <code>[2/2]</code> {#serial-mechanism}


### <span class="org-todo done DONE">DONE</span> <sup id="33cbc6f7bc59ab3b6dddeb95d9d74a7c"><a href="#ozgur2016" title="\Ozg\ur \&amp; Mezouar, Kinematic Modeling and Control of a Robot Arm Using Unit Dual Quaternions, {Robotics and Autonomous Systems}, v(), 66--73 (2016).">ozgur2016</a></sup> {#4501f1}

Very interesting article of kinematic modeling and control of robotic arms. It uses a [Screw Theory]({{< relref "screw_theory" >}}) approach to model the kinematics, much like [Successive Screws]({{< relref "successive_screws" >}}), but using only one frame, doesn't need a [convenient frame]({{< relref "convenient_frame" >}}). Also the metodology is mind opening someway because the authors model the rotations from [end-effector]({{< relref "end_link" >}}) to [base]({{< relref "base_link" >}}), and not the opositte, which in my opinion is easier to understand because going from end to base the successive rotations are not carried by the previous rotations.


### <span class="org-todo done DONE">DONE</span> <sup id="79060351f34034626dee2d4aab2eb000"><a href="#amininan2017" title="Amininan, Sheikhha, Baghyari, Hosseini, Najmabadi \&amp; Akbarzadeh, Explicit {{Inverse Kinematic Solution}} for the {{Industrial FUM Articulated Arm}} Using {{Dual Quaternion Approach}}, 602--607, in in: {2017 5th {{RSI International Conference}} on {{Robotics}} and {{Mechatronics}} ({{ICRoM}})}, edited by {IEEE} (2017)">amininan2017</a></sup> {#288f9f}

The paper solves the [inverse kinematics]({{< relref "inverse_kinematics" >}}) of an specific [serial 6dof industrial arm]({{< relref "serial_mechanism" >}}) using dual quaternions. The [direct kinematics]({{< relref "direct_kinematics" >}}) equations are derived using DQ and through manipulating the equations they can solve it for the inverse kinematics problem. Nothing too fancy or new.


## Parallel Mechanism <code>[1/1]</code> {#parallel-mechanism}


### <span class="org-todo done DONE">DONE</span> <sup id="2f4765c82359a6927562149c92812fbf"><a href="#shabani2021" title="Shabani, Porta \&amp; Thomas, A Branch-and-Prune Method to Solve Closure Equations in Dual Quaternions, {Mechanism and Machine Theory}, v(), 104424 (2021).">shabani2021</a></sup> {#b87efa}

The authors uses dual quaternions to formulate closure loop equations as a system of multiaffine equations, they then introduce a new branch-and-prune method tailored to this type of equations to solve the system which can reduce computing time up to 2 orders of magnitude compared to traditional approaches.


## Dynamics <code>[2/2]</code> {#dynamics}


### <span class="org-todo done DONE">DONE</span> <sup id="a9415d881eb3c65938675574eded8747"><a href="#valverde2018" title="Valverde \&amp; Tsiotras, Dual {{Quaternion Framework}} for {{Modeling}} of {{Spacecraft}}-{{Mounted Multibody Robotic Systems}}, {Front. Robot. AI}, v(), 128 (2018).">valverde2018</a></sup> {#59d396}

The work describes an framework to derive the dynamics of a satellite, but it can be used to a general serial mechanism (at least I think), the proposed framework works with revolute, prismatic, cylindrical, spherical and planar joints. The equations are computed using dual quaternions and [Newton-Euler formulation]({{< relref "newton_euler_method" >}}).


### <span class="org-todo done DONE">DONE</span> <sup id="a88a6598a0751d7ebb8eff58fcc3bf61"><a href="#mirandadefarias2019" title="Miranda de Farias, da Cruz Figueredo \&amp; Yoshiyuki Ishihara, Performance {{Study}} on {{dqRNEA}} \textendash{} {{A Novel Dual Quaternion Based Recursive Newton}}-{{Euler Inverse Dynamics Algorithms}}, 94--101, in in: {2019 {{Third IEEE International Conference}} on {{Robotic Computing}} ({{IRC}})}, edited by {IEEE} (2019)">mirandadefarias2019</a></sup> {#2d7915}

The work do a performace study on an Recursive [Newton-Euler]({{< relref "newton_euler_method" >}}) Inverse Dynamics Algorithm using dual quaternions. The algorithm uses Newton-Euler formulation to compute the kinematics and given the desired accelerations and external forces, computes the necessary torques of the motors to drive the system.

They use dual quaternions in the kinematics and kinetics, for the inertia they create an inertia function (so not explicitily a matrix). They use a screw theory approach for the kinematics, not using DH.

The performance of the algorithm using DQ is compared to using HTM, and the result is favorable to DQ, maybe like 33% less cost in terms of number of operations.


## Desvantagens <code>[0/0]</code> {#desvantagens}


## <span class="org-todo done DONE">DONE</span> Adicionar as referências lidas. {#adicionar-as-referências-lidas-dot}


### <span class="org-todo done DONE">DONE</span> Colocar as referencias no General Overview {#colocar-as-referencias-no-general-overview}


### <span class="org-todo done DONE">DONE</span> Colocar no resto do trabalho {#colocar-no-resto-do-trabalho}


## <span class="org-todo done DONE">DONE</span> Coisas a ver no trabalho {#coisas-a-ver-no-trabalho}


### <span class="org-todo done DONE">DONE</span> Ver se no meu trabalho eu faço o uso de q1.q2 = 0 onde q = q1 + eps q2 {#ver-se-no-meu-trabalho-eu-faço-o-uso-de-q1-dot-q2-0-onde-q-q1-plus-eps-q2}


## <span class="org-todo todo TODO">TODO</span> Fazer as correções de Edson {#fazer-as-correções-de-edson}


## <span class="org-todo todo TODO">TODO</span> O que fazer sobre a parte de Geometric Modeling {#o-que-fazer-sobre-a-parte-de-geometric-modeling}

-   [ ] Tirar
-   [ ] Deixar junto
-   [ ] Deixar separado


## <span class="org-todo todo TODO">TODO</span> Após o artigo {#após-o-artigo}


### <span class="org-todo todo TODO">TODO</span> Ler trabalhos de Featherstone citados em <sup id="33cbc6f7bc59ab3b6dddeb95d9d74a7c"><a href="#ozgur2016" title="\Ozg\ur \&amp; Mezouar, Kinematic Modeling and Control of a Robot Arm Using Unit Dual Quaternions, {Robotics and Autonomous Systems}, v(), 66--73 (2016).">ozgur2016</a></sup> {#ler-trabalhos-de-featherstone-citados-em}
